<?php

namespace Myapp\Domain\Model;

class DiseasesModel extends BaseModel
{

    public static $columns = [
        // 0 master
        [
            'id' => '%d',
            'createdAt' => '%s',
            'updatedAt' => '%s',
            'deleted' => '%d',
        ],
        [
            'name' => "%s",
            'category' => "%s",
            'name_ja' => "%s",
            'summary' => "%s", //todo change type to json
            'symptom' => "%s",
            '1' => '%d',
            '2' => '%d',
            '3' => '%d',
            '4' => '%d',
            '5' => '%d',
            '6' => '%d',
            '7' => '%d',
            '8' => '%d',
        ]
    ];


    public function read()
    {
        
        global $wpdb;
        return $wpdb->get_results(
            "
                SELECT 
                    id, name_ja, summary
                FROM 
                    $wpdb->diseases
            ",
            ARRAY_A,
        );
    }

    public function insertIntialData()
    {
        
        global $wpdb;
        $target_columns = DiseasesModel::$columns[1];
        $initial_data_list = DiseasesModel::$initial_data;

        $column_type_list = array_values($target_columns);

        $column_name_list = array_keys($target_columns);

        foreach ($initial_data_list as $row_data) {
            // $row_data = ['', '', 'ホルモン器系疾患', '', '高血圧、低血圧、心臓疾患、脳疾患、不整脈、動悸、息切れ、血液異常', 1, 1, 0, 0, 1, 0, 0, 0],
            $value_list = [];

            for ($indexOfColumn = 0; $indexOfColumn < count($column_name_list); ++$indexOfColumn) {
                $value_list[$column_name_list[$indexOfColumn]] = $row_data[$indexOfColumn];
            }

            $wpdb->insert(
                $wpdb->diseases,
                $value_list,
                $column_type_list
            );
        }
    }

    ////////////////////////////////////////////////////////////////////////////////
    ////////////////     初期データ
    ////////////////////////////////////////////////////////////////////////////////
    public static $NAME_INDEX = 2;

    // TODO: 英語名をつける
    public static $initial_data = [
        ['', '', 'ホルモン器系疾患', '', '高血圧,低血圧,心臓疾患,脳疾患,不整脈,動悸,息切れ,血液異常', 1, 1, 0, 0, 1, 0, 0, 0],
        ['', '', '内分泌系疾患', 'ホルモン器系やリンパ器系の障害によって起きる症状', 'むくみ,肥満,立ちくらみ,めまい,鼠径部痛,甲状腺異常', 1, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '膵炎', 'アルコールの多飲や胆石症などによって,膵酵素が活性化され,膵組織を自己消化する病態', '左上腹部痛・心窩部痛・悪心・嘔吐・悪寒・発熱・背部放散痛', 1, 0, 0, 0, 0, 1, 0, 0],
        ['', '', '糖尿病', 'インスリンの作用不足によって引き起こされる糖代謝異常をきたす疾患', '　高血糖症状（口渇,多飲,多尿,全身倦怠感）', 1, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '自律神経失調症', '自律神経とは交感神経と副交感神経神経からなる。これらのバランスが不均衡となった状態', '起立性低血圧,唾液過多,胃腸障害など多岐にわたる', 1, 1, 0, 0, 1, 1, 1, 1],
        ['', '', '精神障害', '精神の健康の定義は,「個人が日常のふつうのストレスに対処でき,生産的かつ有意義に働き自分のコミュニティに貢献し得る良好な状態」を言う。これが障害された状態。', '意識混濁,せん妄,錯覚,幻覚,妄想,抑うつ,昏迷,睡眠障害など多岐にわたる', 1, 0, 0, 0, 0, 1, 1, 1],
        ['', '', '不定愁訴', '何となく体調が悪いという程度の漠然とした自覚症状', '頭が重い・イライラする・体がダルい・よく眠れない', 1, 1, 0, 0, 1, 1, 1, 1],
        ['', '', '心臓肥大', '主として左室（ときに両心室）の肥大を主徴とする', '動悸,呼吸困難,めまい,失神,狭心痛', 1, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '心臓疾患', '', '動悸・息切れ・不整脈', 1, 1, 1, 1, 1, 0, 0, 0],
        ['', '', '左頸椎異常', '頸椎は第1〜第7まである。', '損傷部位にもよるが,両上肢,両下肢に症状が出る', 1, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '左手の疾患', '', '', 1, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '逆流動性食道炎', '下部食道括約筋圧の低下などにより,胃酸などの胃内容物が食道に逆流することにより生じる病態', '食後や食間に胸やけ,前胸部痛,悪心', 1, 0, 0, 0, 0, 1, 1, 1],
        ['', '', '嚥下障害', '嚥下機能が器質的・機能的に障害されること', 'とろみの無い水分でむせる。むせずに誤嚥（食道ではなく,気道に水分が入る）することを不顕性誤嚥という', 1, 0, 0, 0, 0, 1, 1, 1],
        ['', '', '肩こり', '肩,首,背中にかけての筋肉のこわばり', 'だるさ,重さ,疲労感,痛み', 1, 0, 0, 0, 0, 1, 1, 1],
        ['', '', '五十肩', '関節包滑膜および周囲の結合組織にみられる慢性炎症', '肩の痛み,運動制限', 1, 0, 0, 0, 0, 1, 1, 1],
        ['', '', '前頭部の頭痛', '', '', 1, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '眼精疲労', '目の酷使により生じる症状', '目の疲労感,痛みに加えて,頭痛や肩こりを生じる場合もある', 1, 1, 0, 0, 1, 1, 0, 0],
        ['', '', '緑内障', '眼圧の異常な上昇により,視力や視野の障害が起こるもの', '虹視症,激しい眼痛,頭痛,嘔気,視力低下,充血', 1, 1, 0, 0, 1, 0, 0, 0],
        ['', '', '冷え性', '主に血流障害により生じる体の冷え', '胃痛,便秘,しもやけ,腰痛,神経痛,肩こり,肌荒れなど', 1, 1, 1, 1, 1, 1, 0, 0],
        ['', '', '発汗過多', '発汗が過剰になった状態。ストレスや運動,高温環境など様々な原因がある。', '発汗量の増加による脱水', 1, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '手足の火照り', '', '', 1, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '膠原病名種', '結合組織を炎症反応の主な場所とする全身性慢性炎症疾患', '発熱,関節炎,皮膚症状など', 1, 1, 0, 0, 1, 1, 0, 0],
        ['', '', '肥満', '', '', 1, 0, 0, 0, 0, 1, 0, 0],
        ['', '', 'アカラシア', '食道下部平滑筋層内のアウエルバッハ神経節の後天的な変性・消失により,食道の正常な蠕動運動の欠如と,噴門部括約筋の弛緩不全が生じる疾患', '嚥下障害（特に冷たい流動物）,栄養障害,誤嚥による肺感染', 1, 0, 0, 0, 0, 1, 1, 1],
        ['', '', '左肺の異常', '', '', 1, 0, 0, 0, 0, 0, 0, 0],
        ['', '', 'リンパ器系疾患', '', '', 0, 1, 0, 0, 1, 0, 0, 0],
        ['', '', 'むくみ', '', '', 0, 1, 1, 1, 1, 0, 0, 0],
        ['', '', '浮腫', '細胞外液（間質液+血漿）のうち間質液が病的に増加した状態', '部分的,もしくは全身のむくみ', 0, 1, 1, 1, 1, 0, 0, 0],
        ['', '', '頻尿', '1日の尿回数が通常よりも多い場合（1日8〜10回以上,夜間の場合は就寝時2回以上）をいう', '頻尿を来す病態として,多尿・膀胱容量の減少,膀胱の炎症などがある', 0, 1, 1, 1, 1, 0, 0, 0],
        ['', '', '耳鳴り', '周囲の音ではなく,耳の中で発生している雑音', '様々な音が聞こえる', 0, 1, 0, 0, 1, 0, 0, 0],
        ['', '', '難聴', '聴覚が低下した状態のこと', '突発性難聴の場合,耳鳴りやめまい・嘔気を伴う', 0, 1, 0, 0, 1, 0, 0, 0],
        ['', '', '全身怠惰感', '', '', 0, 1, 1, 1, 1, 0, 1, 1],
        ['', '', '全身疲労', '', '', 0, 1, 1, 1, 1, 0, 0, 0],
        ['', '', 'めまい', '', '', 0, 1, 0, 0, 1, 0, 0, 0],
        ['', '', '不眠症', '', '', 0, 1, 0, 0, 1, 0, 0, 0],
        ['', '', '潜血', '', '', 0, 1, 0, 0, 1, 0, 0, 0],
        ['', '', '更年期障害', '卵巣機能が減退し消失するまでの時期に生じる,自律神経失調を中心としたさまざまな不定愁訴を呈する症候群', '血管運動性症状（顔面紅潮,のぼせ,発汗,動悸,頭痛,めまい）,精神神経症状（憂うつ感,イライラ,不安,不眠,記憶力低下）,肩こり,腰痛,倦怠感,手足のしびれなど', 0, 1, 0, 0, 1, 0, 1, 1],
        ['', '', '腰痛', '', '', 0, 1, 1, 1, 1, 0, 0, 0],
        ['', '', '股関節痛', '', '', 0, 1, 1, 1, 1, 0, 0, 0],
        ['', '', '鼠経部痛', '', '', 0, 1, 1, 1, 1, 0, 0, 0],
        ['', '', '坐骨神経痛', '坐骨神経に沿ってお尻から脚の後面や外側にかけて起こる痛み', '下肢のしびれ,痛み,長い時間歩けない', 0, 1, 1, 1, 1, 0, 0, 0],
        ['', '', '下肢の異常', '', '膝・足首', 0, 1, 1, 1, 1, 0, 0, 0],
        ['', '', '足の痺れ', '', '', 0, 1, 1, 0, 0, 0, 0, 0],
        ['', '', '血液異常', '', '', 0, 1, 0, 0, 1, 0, 0, 0],
        ['', '', '解毒', '', '', 0, 1, 0, 0, 1, 0, 0, 0],
        ['', '', 'メニエール病', '内リンパ液の内圧が上昇し,内リンパ水腫が生じる内耳疾患', '回転性のめまい,耳鳴り,難聴,悪心,嘔吐,冷汗,動悸', 0, 1, 0, 0, 1, 0, 0, 0],
        ['', '', '便秘', '', '', 0, 0, 1, 1, 0, 0, 0, 0],
        ['', '', '下痢', '', '', 0, 0, 1, 1, 0, 0, 0, 0],
        ['', '', '生理痛', '', '', 0, 0, 1, 1, 0, 0, 0, 0],
        ['', '', '生理不順', '', '', 0, 0, 1, 1, 0, 0, 0, 0],
        ['', '', '子宮筋腫', '子宮筋組織から発生する良性腫瘍で,子宮に発生する腫瘍のうち,最も頻度が高い', '過多月経,過長月経,貧血,月経困難症,頻尿,便秘,腰痛,不正性器出血,不妊,流産,早産', 0, 0, 1, 1, 0, 0, 0, 0],
        ['', '', '卵巣嚢腫', '', '', 0, 0, 1, 1, 0, 0, 0, 0],
        ['', '', '子宮内膜症', '', '', 0, 0, 1, 1, 0, 0, 0, 0],
        ['', '', '膀胱炎', '', '', 0, 0, 1, 1, 0, 0, 0, 0],
        ['', '', '腹部膨満感', '', '', 0, 0, 1, 1, 0, 0, 0, 0],
        ['', '', '腹部異常', '', '', 0, 0, 1, 1, 0, 0, 0, 0],
        ['', '', '仙骨の異常', '', '', 0, 0, 1, 0, 0, 0, 0, 0],
        ['', '', '腹部の痛み', '', '', 0, 0, 1, 1, 0, 0, 0, 0],
        ['', '', '足のしびれ', '', '', 0, 0, 0, 1, 1, 0, 0, 0],
        ['', '', '坐骨の異常', '', '', 0, 0, 0, 1, 0, 0, 0, 0],
        ['', '', '血圧異常', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '十二指腸腫瘍', '', '', 0, 0, 0, 0, 0, 1, 0, 0],
        ['', '', '肝障害', '', '', 0, 0, 0, 0, 0, 1, 0, 0],
        ['', '', '胆嚢閉塞', '', '', 0, 0, 0, 0, 0, 1, 0, 0],
        ['', '', '胆管閉塞', '', '', 0, 0, 0, 0, 0, 1, 0, 0],
        ['', '', '右肺の異常', '', '', 0, 0, 0, 0, 0, 1, 0, 0],
        ['', '', '右頸椎異常', '', '', 0, 0, 0, 0, 0, 1, 1, 1],
        ['', '', '右手の疾患', '', '', 0, 0, 0, 0, 0, 1, 1, 1],
        ['', '', '飛蚊症', '', '', 0, 0, 0, 0, 0, 1, 0, 0],
        ['', '', '白内障', '', '', 0, 0, 0, 0, 0, 1, 0, 0],
        ['', '', 'イライラ', '', '', 0, 0, 0, 0, 0, 1, 0, 0],
        ['', '', '腹部異常各種', '', '', 0, 0, 0, 0, 0, 0, 1, 1],
        ['', '', '慢性疲労', '', '', 0, 0, 0, 0, 0, 0, 1, 1],
        ['', '', '呼吸が出来ない', '', '', 0, 0, 0, 0, 0, 0, 1, 1],
        ['', '', '胃酸過多', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '胃潰瘍', 'ストレスが原因で起こることが多い現代社会の代表的な病気で,胃液中の「塩酸」や「ペプシン」という物質が,胃を保護している粘膜を消化してしまう状態', '腹痛,出血による貧血', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '胃痛', '胃酸の過剰な分泌や細菌などによって胃の粘膜が傷つけられてしまう場合や,胃の機能が低下して不調が起きる場合がある', '暴飲暴食・胃酸過多・ストレス・急性胃炎', 0, 0, 0, 0, 0, 0, 0, 0],

        ['', '', '風邪', '', '', 1, 1, 0, 0, 1, 1, 0, 0],
        ['', '', '高血圧', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '高脂血症', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '癌', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '脳血管障害', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', 'ほてり', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '花粉症', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', 'アトピー', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '不妊症', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '生理痛', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '生理不順', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', 'うつ', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '疲れ目', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '耳鳴り', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '頭痛', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', 'めまい', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '打撲', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '骨折', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '靭帯損傷', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '捻挫', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', 'むち打ち', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '事故', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
        ['', '', '手術', '', '', 0, 0, 0, 0, 0, 0, 0, 0],
    ];
}
